HEYAHONG/Programer_discarded/Data_Programer/STM32_Data_ProgramerDlg.cpp
}

STM32_Data_ProgramerDlg::~STM32_Data_ProgramerDlg()
{
} 

void STM32_Data_ProgramerDlg::CreateGUIControls()
{
	//Do not add custom code between
	//GUI Items Creation Start and GUI Items Creation End.
	//wxDev-C++ designer will remove them.
	//Add the custom code before or after the blocks
	////GUI Items Creation Start

	WxButton3 = new wxButton(this, ID_WXBUTTON3, _("烧录"), wxPoint(242, 70), wxSize(101, 29), 0, wxDefaultValidator, _("WxButton3"));

	WxCheckBox2 = new wxCheckBox(this, ID_WXCHECKBOX2, _("循环烧录"), wxPoint(158, 77), wxSize(73, 16), 0, wxDefaultValidator, _("WxCheckBox2"));

	WxCheckBox1 = new wxCheckBox(this, ID_WXCHECKBOX1, _("更新hex"), wxPoint(71, 77), wxSize(73, 16), 0, wxDefaultValidator, _("WxCheckBox1"));
	WxCheckBox1->SetValue(true);

	WxStaticLine2 = new wxStaticLine(this, ID_WXSTATICLINE2, wxPoint(0, 106), wxSize(414, -1), wxLI_HORIZONTAL);
	WxStaticLine2->SetForegroundColour(wxColour(0,0,0));

	WxStaticLine1 = new wxStaticLine(this, ID_WXSTATICLINE1, wxPoint(1, 65), wxSize(414, -1), wxLI_HORIZONTAL);
	WxStaticLine1->SetForegroundColour(wxColour(0,0,0));

	WxButton2 = new wxButton(this, ID_WXBUTTON2, _("搜索插件"), wxPoint(353, 33), wxSize(64, 24), 0, wxDefaultValidator, _("WxButton2"));

	WxStaticText3 = new wxStaticText(this, ID_WXSTATICTEXT3, _("烧录插件："), wxPoint(185, 35), wxDefaultSize, 0, _("WxStaticText3"));

	WxStaticText2 = new wxStaticText(this, ID_WXSTATICTEXT2, _("更新插件："), wxPoint(2, 35), wxDefaultSize, 0, _("WxStaticText2"));

	wxArrayString arrayStringFor_WxComboBox2;
	WxComboBox2 = new wxComboBox(this, ID_WXCOMBOBOX2, _(""), wxPoint(242, 33), wxSize(107, 25), arrayStringFor_WxComboBox2, wxTE_READONLY, wxDefaultValidator, _("WxComboBox2"));

	wxArrayString arrayStringFor_WxComboBox1;
	WxComboBox1 = new wxComboBox(this, ID_WXCOMBOBOX1, _(""), wxPoint(60, 33), wxSize(121, 25), arrayStringFor_WxComboBox1, wxTE_READONLY, wxDefaultValidator, _("WxComboBox1"));

	WxTimer1 = new wxTimer();
	WxTimer1->SetOwner(this, ID_WXTIMER1);
	WxTimer1->Start(300);

	WxEdit1 = new wxTextCtrl(this, ID_WXEDIT1, _("data/"), wxPoint(69, 2), wxSize(272, 26), wxTE_LEFT, wxDefaultValidator, _("WxEdit1"));

	WxStaticText1 = new wxStaticText(this, ID_WXSTATICTEXT1, _("数据目录："), wxPoint(5, 6), wxDefaultSize, 0, _("WxStaticText1"));

	WxButton1 = new wxButton(this, ID_WXBUTTON1, _("打开"), wxPoint(348, 1), wxSize(70, 26), 0, wxDefaultValidator, _("WxButton1"));

	Info = new wxTextCtrl(this, ID_WXEDIT1_Info, _(""), wxPoint(2, 116), wxSize(415, 172), wxTE_READONLY | wxTE_LEFT | wxTE_MULTILINE, wxDefaultValidator, _("Info"));

	SetTitle(_("STM32_Data_Programer"));
	SetIcon(wxNullIcon);
	SetSize(8,8,436,330);
	Center();
	
	////GUI Items Creation End
}

void STM32_Data_ProgramerDlg::OnClose(wxCloseEvent& /*event*/)
{
    WxTimer1->Stop(); 
	Destroy();
}

#include "string.h"
#include "stdlib.h"
#include "stdio.h"
#include "dir.h"
#include "dirent.h"
#include "unistd.h"
#ifdef WIN32
#include "windows.h"
#endif
void STM32_Data_ProgramerDlg::Data_Init()
{
    //DataDir="data/";
    while(access(((std::string)(DataDir+"/config.cfg").c_str()).c_str(),R_OK) )
    {
        Info->AppendText("原数据目录不存在config.cfg\n");
        wxDirDialog dlg(this,"选择数据存放目录","data",wxDD_DIR_MUST_EXIST|wxDD_DEFAULT_STYLE);
        if(dlg.ShowModal()==wxID_OK) 
        {
            DataDir=dlg.GetPath();
            	{//更新数据目录显示框 
                	wxString Temp=DataDir;
    	            WxEdit1->Clear();
    	            WxEdit1->AppendText(Temp); 
                }
            Info->AppendText((wxString)"修改数据目录为:"+DataDir+"\n");
        }
    }
    {//将DataDir放入环境变量
        char buff[8192];
        sprintf(buff,"DataDir=%s",((std::string)DataDir.c_str()).c_str());
        putenv(buff); 
    } 
    
    {//将config的内容使用putenv添加到环境变量
        FILE *fp=NULL;
        char buff[8192];
        memset(buff,0,sizeof(buff)); 
        fp=fopen(((std::string)(DataDir+"/config.cfg").c_str()).c_str(),"r");
        if(fp==NULL)
            {
                Info->AppendText("config.cfg由于未知原因无法打开\n");
                return;
            }
        while(NULL != fgets(buff,sizeof(buff),fp))
        {
            if((buff[0]=='#') || (buff[0]==';') || (buff[0]=='/'))
                    continue;//跳过注释行
            for(size_t i=0;i<strlen(buff);i++)
                {//除去结尾的回车符
                    if(buff[i]=='\n' || buff[i] == '\r')
                        buff[i]=0; 
                }
            
            if(strstr(buff,"=")!= NULL)
                        if(putenv(buff))//将含有等号的行添加到环境变量 
                            {
                                Info->AppendText("添加环境变量失败"); 
                            }
           // //测试读取内容
//            Info->AppendText(buff); 
            
            memset(buff,0,sizeof(buff));
        }
        fclose(fp);
         
    } 
    {
        wxString data=getenv("data");
        wxString sub="hex";
        if(!(data.Mid(data.Len()-3)).CmpNoCase(sub))
                {   
                    
                   {//打开hex文件
                     FILE *fp=fopen(((std::string) (DataDir+"/"+data).c_str()).c_str(),"rb");
                     if(fp == NULL)
                        {
                            Info->AppendText("hex文件不存在!\n");
                            return;
                        } 
                    if(hex_data!=NULL)
                             {
                                    free(hex_data);
                                    hex_data=NULL;
                             }
                    fseek(fp,0,SEEK_END);
                    size_t len = ftell(fp);
                    fseek(fp,0,SEEK_SET);                       
                    uint8_t *   data=(uint8_t *)malloc((len+50)*sizeof(uint8_t));
                    //memset(data,0,len+50);
                     { 
                        size_t pos=0,read_num=0;
                        while(len-pos>=1)
                          {
                               read_num=fread(data+pos,1,32,fp); 
                               pos+=read_num;
                          };
                     }
                    if(strlen((const char *)data)>=len)
                        {
                            hex_data=data;
                            
