HEYAHONG/Programer_discarded/Data_Programer/STM32_Data_ProgramerDlg.cpp
                        }
                    fclose(fp);
                        
                   }
                    {
                     char buff[100];
                     memset(buff,0,sizeof(buff));
                     sprintf(buff,"%d",strlen((const char *)hex_data));                 
                     Info->AppendText((wxString)"警告:数据文件"+data+"(长度:"+buff+")未加密!\n");
                    }
                }
        else
            {//密码框
                FilePassWord dlg(this);
                if(dlg.ShowModal()!= wxID_OK)
                    {
                        Info->AppendText("警告:密码验证出现错误,可能需要重新设置数据目录\n");
                        dlg.Destroy();
                    }
                else
                    {//密码验证成功,将文件加载至内存
                         dlg.Destroy();
                         char *password=getenv("data_password");                         
                         uint8_t *data=NULL;
                         if(password==NULL)
                            {
                                Info->AppendText("内部错误,找不到密码项\n");
                                return;
                            } 
                          uint8_t aes_in[32],aes_out[32],aes_key[32];
                          memset(aes_key,0,sizeof(aes_key));
                          strcpy((char *)aes_key,password);
                          {
                                //uint8_t *w=aes_init(32);
                                //aes_key_expansion(aes_key,w);
                                struct aes256_ctx ctx;
                                aes256_set_decrypt_key(&ctx,aes_key);
                                {
                                    FILE *fp=fopen(((std::string)(DataDir+"/"+getenv("data")).c_str()).c_str(),"rb");
                                    if(fp != NULL)
                                    {
                                        fseek(fp,0,SEEK_END);
                                        size_t size=ftell(fp),pos=0;
                                        fseek(fp,0,SEEK_SET);                                                                                
                                        //fseek(fp,32,SEEK_SET);//跳过文件头
                                        fread(aes_out,32,1,fp);//跳过文件开头 
                                        if((size%32)!=0)
                                            { 
                                               Info->AppendText("文件可能存在错误!\n"); 
                                            } 
                                        data=(uint8_t *)malloc((size+50)*sizeof(uint8_t));
                                        //memset(data,0,size+50);
                                        do
                                        {
                                            memset(aes_in,0,sizeof(aes_in));
                                            memset(aes_out,0,sizeof(aes_out));
                                            size_t read_num=fread(aes_in,1,32,fp);
                                            if(read_num != 32)
                                                {
                                                    Info->AppendText("读取错误\n");
                                                }
                                            //aes_key_expansion(aes_key,w);
                                            //aes_inv_cipher(aes_in,aes_out,w);
                                            aes256_decrypt(&ctx,32,aes_out,aes_in);                                            
                                            //Info->AppendText(aes_out);                                             
                                            memcpy((char *)data+pos,(char *)aes_out,32);
                                            pos+=32;
                                            
                                        } while(size-pos>32);
                                        fclose(fp);
                                        
                                        {
                                            if(hex_data != NULL)
                                                {
                                                    free(hex_data);
                                                }
                                            hex_data=data;
                                            {
                                                char buff[100];
                                                memset(buff,0,sizeof(buff));
                                                sprintf(buff,"%d",strlen((char *)hex_data)); 
                                                
                                                //Info->AppendText(hex_data);
                                                
                                                Info->AppendText((wxString)"加密数据hex大小:"+buff+"B\n"); 
                                            }
                                        }
                                    }
                                                                        
                                }
                                
                               // free(w);
                          }                     
                    };                
            } 
    }
    {//测试环境变量
    #ifdef WIN32
    //WinExec("cmd.exe",SW_SHOW);
    #endif 
    } 
}




/*
 * STM32_Data_ProgramerDlgEnterWindow
 */
void STM32_Data_ProgramerDlg::STM32_Data_ProgramerDlgEnterWindow(wxMouseEvent& event)
{
	// insert your code here
		
}

/*
 * STM32_Data_ProgramerDlgInitDialog
 */
void STM32_Data_ProgramerDlg::STM32_Data_ProgramerDlgInitDialog(wxInitDialogEvent& event)
{
	// insert your code here
	//Data_Init();
}

/*
 * WxButton1Click
 */
void STM32_Data_ProgramerDlg::WxButton1Click(wxCommandEvent& event)
{
	// insert your code here
	Data_Init();

}

/*
 * STM32_Data_ProgramerDlgSetFocus
 */
void STM32_Data_ProgramerDlg::STM32_Data_ProgramerDlgSetFocus(wxFocusEvent& event)
{
	// insert your code here
	
