HEYAHONG/Programer_discarded/Data_Programer/STM32_Data_ProgramerDlg.cpp
}

/*
 * STM32_Data_ProgramerDlgActivate
 */
void STM32_Data_ProgramerDlg::STM32_Data_ProgramerDlgActivate(wxActivateEvent& event)
{
	// insert your code here
	
}

/*
 * WxTimer1Timer
 */
void STM32_Data_ProgramerDlg::WxTimer1Timer(wxTimerEvent& event)
{
	// insert your code here
	{
        static bool Is_Init=false;
        if(!Is_Init)
        {
            Is_Init=true;
            WxTimer1->Stop();
            WxTimer1->Start(3000);
            WxEdit1->Clear();
            WxEdit1->AppendText("data/");
            Data_Init();
            search_plugin();
            
        }
    }
    {   
        static bool Is_Running=false;
        if(!Is_Running)//不执行重复烧写  
            if(WxCheckBox2->IsChecked() && WxButton3->IsEnabled())//循环烧写被选中 
            {
                Is_Running=true;
                WxButton3->Disable();
                start_flash(); 
                Is_Running=false;
            }

    }
}

/*
 * WxEdit1Updated
 */
void STM32_Data_ProgramerDlg::WxEdit1Updated(wxCommandEvent& event)
{
	// insert your code here
	DataDir=WxEdit1->GetValue();
}
#include "unistd.h"
#include "dirent.h"
void STM32_Data_ProgramerDlg::search_plugin()
{//搜索plugin目录，类型为1的放入WxComboBox1，类型为2的放入WxComboBox2
if(access("plugin/",4))
{
    Info->AppendText("指定插件目录不存在!\n");
    return;
}
{//遍历目录
  DIR *dir=NULL;
  if((dir=opendir("plugin/"))==NULL)
  {
    Info->AppendText("打开插件目录失败!\n");
    return;
  } 
  struct dirent * file=NULL;
  {//清空控件上原有的内容
    WxComboBox1->Clear();
    WxComboBox2->Clear(); 
  }
  while((file=readdir(dir))!=NULL)
  { 
        //if(file->d_type==DT_REG)//正常文件 
        {
            char path[8192];
            memset(path,0,sizeof(path));
            sprintf(path,"plugin/%s",file->d_name);
            void *dll=dlopen(path,RTLD_GLOBAL);
            if(dll==NULL)
                {
                    continue;
                }
             get_plugin_type_t  get_plugin_type=(get_plugin_type_t)dlsym(dll,"get_plugin_type");
             if(dlerror()==NULL)
                 {
                        unsigned int type=(*get_plugin_type)();
                        if(type==1)
                        {
                          WxComboBox1->Insert(file->d_name,0); 
                          WxComboBox1->Select(0);                             
                        };
                        if(type==2)
                        {
                          WxComboBox2->Insert(file->d_name,0);  
                          WxComboBox2->Select(0); 
                        };
                 }
             dlclose(dll);            
        }
        
  }
  closedir(dir); 
}    
}

/*
 * WxButton2Click
 */
void STM32_Data_ProgramerDlg::WxButton2Click(wxCommandEvent& event)
{
	// insert your code here
	search_plugin(); 
}

void STM32_Data_ProgramerDlg::start_flash()
{
	// insert your code here
	flash_thread * p=new flash_thread(this);
//	process_hex_t       process_hex=NULL;
//    process_program_t   process_program=NULL;
//    void * dll_hex=NULL;
//    void * dll_program=NULL;
//    
//    
//	WxButton3->Disable();
//	WxButton3->SetBackgroundColour(wxNullColour);
//	
//	Info->Clear();
//	Info->AppendText("开始烧写\n");
//    {
//        Info->AppendText("检查hex数据\n");
//        if((hex_data==NULL) || (strlen((char *)hex_data) ==0) )
//            {
//                Info->AppendText("hex数据不存在\n");
//                WxButton3->SetBackgroundColour(wxColor(255,0,0));
//                goto EndOfStart_Flash;
//            }  
//        size_t pos;
//        for(pos=0;pos<strlen((char *)hex_data);pos++)
//        {
//            if(!((hex_data[pos] >= 'A' && hex_data[pos] <='F')||
//                 (hex_data[pos] >= 'a' && hex_data[pos] <='f')||
//                 (hex_data[pos] >= '0' && hex_data[pos] <='9')||
//                 (hex_data[pos] == ':' || hex_data[pos]=='\n' ||
//                  hex_data[pos] =='\r') ))
//            {//检测到非法字符 
//                Info->AppendText("hex数据中检测到非法字符\n");
//                WxButton3->SetBackgroundColour(wxColor(255,0,0));
//                goto EndOfStart_Flash; 
//            }
//        } 
//        {
//            char buff[8192];
//            sprintf(buff,"hex数据长度:%d\n",strlen((char *)hex_data));
//            Info->AppendText(buff);
//        }       
//    }
//    //加载插件
//    if(WxCheckBox1->IsChecked())
//    {//加载更新hex插件
//        char path[8192];
//        sprintf(path,"plugin/%s",((std::string)WxComboBox1->GetValue().c_str()).c_str());
//        if((dll_hex=dlopen(path,RTLD_GLOBAL))==NULL)
//        {
//            Info->AppendText("打开更新插件失败！\n"); 
//            WxButton3->SetBackgroundColour(wxColor(255,0,0));
//            goto EndOfStart_Flash;
//        } 
//        process_hex=(process_hex_t)dlsym(dll_hex,"process_hex");
//        if(dlerror()!=NULL)
//        {
//            dlclose(dll_hex);
//            Info->AppendText("加载更新插件失败！\n");
//            WxButton3->SetBackgroundColour(wxColor(255,0,0));
//            goto EndOfStart_Flash;
//        }
//        Info->AppendText("更新插件加载成功！\n");
//    }
//    
//    {//加载烧录插件
//        char path[8192];
//        sprintf(path,"plugin/%s",((std::string)WxComboBox2->GetValue().c_str()).c_str());
//        if((dll_hex=dlopen(path,RTLD_GLOBAL))==NULL)
//        {
//            Info->AppendText("打开烧录插件失败！\n"); 
//            WxButton3->SetBackgroundColour(wxColor(255,0,0));
//            goto EndOfStart_Flash;
//        } 
//        process_program=(process_program_t)dlsym(dll_hex,"process_program");
//        if(dlerror()!=NULL)
//        {
//            dlclose(dll_hex);
//            Info->AppendText("加载烧录插件失败！\n");
//            WxButton3->SetBackgroundColour(wxColor(255,0,0));
//            goto EndOfStart_Flash;
//        }
//        Info->AppendText("烧录插件加载成功！\n"); 
//    }
//    
//    {//执行更新
//        if(WxCheckBox1->IsChecked())
//        {
//            Info->AppendText("开始更新\n");
//            if(process_hex(hex_data)<=0)
//            {
//              Info->AppendText("更新失败\n"); 
//              WxButton3->SetBackgroundColour(wxColor(255,0,0));
//              goto AbortOp;  
//            } 
//        } 
//         
//    }
//    
//    {//执行烧录
//        Info->AppendText("开始烧录\n");
//        if(process_program(hex_data)<=0)
//        {
//            Info->AppendText("烧录失败\n"); 
//            WxButton3->SetBackgroundColour(wxColor(255,0,0));
//            goto AbortOp;
//        } 
//        
//    } 
//            
//     
//    WxButton3->SetBackgroundColour(wxColor(0,255,0));
//    Info->AppendText("操作完成!\n");
//AbortOp:
//	//卸载插件
//    if(dll_hex != NULL)
//        dlclose(dll_hex);
//    if(dll_program!=NULL)
//        dlclose(dll_program); 
//EndOfStart_Flash:
//	WxButton3->Enable();
}

/*
 * WxButton3Click
 */
void STM32_Data_ProgramerDlg::WxButton3Click(wxCommandEvent& event)
{
	// insert your code here
	start_flash(); 
}
wxTextCtrl * STM32_Data_ProgramerDlg::Get_Info_Ctl()
{
    return Info; 
}
